name: "ensemble"
platform: "ensemble"
max_batch_size: 4
input [
  {
    name: "input.1"
    data_type: TYPE_FP32
#    format: FORMAT_NCHW
    dims: [ -1, 3, 480, 640]
#    reshape { shape: [ 1, 3, 480, 640 ] }
  }
]

output [
  {
    name: "537"
    data_type: TYPE_FP32
    dims: [ -1, 1, -1, -1 ]
   # reshape { shape: [ 1, 1, 1, 1 ] }
    label_filename: "centerface_labels.txt"
  },
  {
    name: "538"
    data_type: TYPE_FP32
    dims: [ -1, 2, -1, -1]
    label_filename: "centerface_labels.txt"
  },

  {
    name: "539"
    data_type: TYPE_FP32
    dims: [-1,  2, -1, -1]
    label_filename: "centerface_labels.txt"
  },
  {
    name: "540"
    data_type: TYPE_FP32
    dims: [-1, 10 , -1, -1]
    label_filename: "centerface_labels.txt"
  }
]
ensemble_scheduling {
  step [
    {
        model_name: "centerface"
        model_version: -1
        input_map {
        key: "input.1"
        value: "input.1"
      }
      output_map {
        key: "537"
        value: "a537"
      }
       output_map {
        key: "538"
        value: "a538"
      }
       output_map {
        key: "539"
        value: "a539"
      }
       output_map {
        key: "540"
        value: "a540"
      }
    },

    {
      model_name: "postprocess"
      model_version: -1
      input_map {
        key: "537"
        value: "a537"
      }
      input_map {
        key: "538"
        value: "a538"
      }
      input_map {
        key: "539"
        value: "a539"
      }
      input_map {
        key: "540"
        value: "a540"
      }
      
      output_map {
        key: "o537"
        value: "537"
      }
       output_map {
        key: "o538"
        value: "538"
      }
       output_map {
        key: "o539"
        value: "539"
      }
       output_map {
        key: "o540"
        value: "540"
      }
    }
  ]
}
