name: "preprocess"
backend: "python"
max_batch_size: 256 
input [
{
    name: "INPUT_PREPROCESS"
    data_type: TYPE_UINT8
    dims: [ -1 ]
}
]
 
output [
{
    name: "OUTPUT_PREPROCESS"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224 ]
}
]

instance_group [{ kind: KIND_CPU }]
