name: "preprocess"
backend: "python"
max_batch_size: 0
input [
  {
    name: "input.1"
    data_type: TYPE_FP32
#    format: FORMAT_NCHW
    dims: [ -1, 3, 480, 640]
#    reshape { shape: [ 1, 3, 480, 640 ] }
  }
]

output [
  {
    name: "output.1"
    data_type: TYPE_FP32
#    format: FORMAT_NCHW
    dims: [ -1, 3, 480, 640]
#    reshape { shape: [ 1, 3, 480, 640 ] }
  }
] 
	

