name: "ensemble_face"
platform: "ensemble"
max_batch_size: 4
input [
  {
    name: "INPUT_ENSEMBLE"
    data_type: TYPE_UINT8
    dims: [ 112,112,3 ]
  }
]
output [
  {
    name: "OUTPUT_FEATURE"
    data_type: TYPE_FP32
    dims: [ 512 ]
  }
]
ensemble_scheduling {
  step [
    {
     model_name: "preprocess_face"
      model_version: -1
      input_map {
        key: "INPUT_PREPROCESS_FACE"
        value: "INPUT_ENSEMBLE"
      }
      output_map {
        key: "OUTPUT_PREPROCESS_FACE"
        value: "IMAGE_PROCESSED_FACE"
      }
    },
    {
      model_name: "face_extraction"
      model_version: -1
      input_map {
        key: "input.1"
        value: "IMAGE_PROCESSED_FACE"
      }
      output_map {
        key: "267"
        value: "OUTPUT_FEATURE"
      }
    }
  ]
}
