name: "ensemble"
platform: "ensemble"
max_batch_size: 8
input [
  {
    name: "input"
    data_type: TYPE_FP32
#    format: FORMAT_NCHW
    #dims: [ 3,112, 112]
#    reshape { shape: [ 1, 3, 480, 640 ] }
  }
]
output[
{
    name: "output"
    data_type: TYPE_FP32
    dims: [ 512 ]
    #label_filename: "labels.txt"
}
]


ensemble_scheduling {
  step [
     {
        model_name: "preprocess"
        model_version: -1
        input_map {
        key: "input"
        value: "input"
        }
        
         output_map {
         key: "output"
         value: "output_1"
        }

    },
    {
    model_name: "extraction"
        model_version: -1
        input_map {
        key: "input"
        value: "output_1"
        }

         output_map {
         key: "output"
         value: "output"
        }
    }
  ]
}
